# Brewfile by Andy Wenk
#
# This is the software I use on a fresh machine.

# tap

#tap "homebrew/cask"
#tap "heroku/brew"
#tap "twilio/brew"
#tap "elastic/tap"			        # https://www.elastic.co/guide/en/elasticsearch/reference/7.13/brew.html
tap "shivammathur/php"
cask_args appdir: "/Applications"

# ~~~~~~~~~ Tryout ~~~~~~~~~ 

cask "inkdown"
cask "itermai"
cask "emclient"  
brew "zfind"
brew "qrtool"

# ~~~~~~~~~ Unix tools ~~~~~~~~~ 

brew "git"
brew "gzip"
brew "p7zip"				        # https://github.com/jinfeihan57/p7zip
brew "pwgen"
brew "wget"
brew "htop"
brew "imagemagick"
cask "iterm2"
cask "the-unarchiver"
brew "vim"
brew "tree"
#brew "rclone"
#brew "rsync"
#brew "tldr"					# https://tldr.sh/
#brew "ncdu"					# https://dev.yorhel.nl/ncdu
brew "ffmpeg"					# https://ffmpeg.org/
brew "broot"					# https://dystroy.org/broot/
#brew "shellcheck"				# https://www.shellcheck.net/
#brew "mmv"				        # https://github.com/rrthomas/mmv
#brew "mkcert"                       		# https://github.com/FiloSottile/mkcert
#brew "rmlint"			                # https://github.com/sahib/rmlint
#brew "irssi"			                # https://irssi.orgq
#brew "asciinema"				# https://asciinema.org/
brew "tmux"					# https://github.com/tmux/tmux/wiki
#brew "pre-commit"				# https://pre-commit.com/
#cask "appflowy"				# https://github.com/AppFlowy-IO/appflowy
brew "gh"					# https://cli.github.com/
cask "mountain-duck"				# https://mountainduck.io/
brew "b2-tools"					# https://www.backblaze.com/b2/docs/quick_command_line.html		
brew "poppler"					# PDF tools	
cask "tunnelblick"				# 	
#cask "viscosity"
brew "superfile"				# https://github.com/MHNightCat/superfile?tab=readme-ov-file#homebrew
brew "nextdns"					# https://my.nextdns.io/764af8/setup
brew "zstd"					#
brew "pdfcrack"					# https://pdfcrack.sourceforge.net/
cask "platypus"					# https://sveinbjorn.org/platypus	
brew "xmlstarlet"				#
brew "libjpeg"
brew "libjpeg-turbo"                
brew "libpng"

# ~~~~~~~~~ System Cleaning ~~~~~~~~~~

brew "trash-cli"				# https://github.com/andreafrancia/trash-cli
brew "fdupes"					# https://github.com/adrianlopezroche/fdupes
brew "fd"					# https://github.com/sharkdp/fd
brew "ncdu"					# https://dev.yorhel.nl/ncdu

# ~~~~~~~~~ Network ~~~~~~~~~

#cask "wireshark"		                # https://www.wireshark.org/ | https://gitlab.com/wireshark/wireshark/wikis/
brew "nmap"
brew "libpcap"
#brew "hping"
cask "nperf"					# https://www.nperf.com/en/
cask "little-snitch"				# https://www.obdev.at/products/littlesnitch/index.html
brew "telnet" 

# ~~~~~~~~~ Tools ~~~~~~~~~ 

cask "caffeine"
cask "1password@beta"		          	# https://1password.com/
cask "1password-cli"
#cask "gpg-suite"
#cask "cakebrew"
#cask "kindle"
#cask "gemini"			                # https://macpaw.com/gemini
cask "deepl"			                # https://www.deepl.com/translator	
#cask "rcloneosx"
#cask "rsyncosx"
#brew "cabextract"
cask "raindropio"				# https://raindrop.io	
cask "bettertouchtool"		          	# https://folivora.ai/
#cask "licecap"			                # https://www.cockos.com/licecap/
#cask "hiddenbar"		                # https://github.com/dwarvesf/hidden
#cask "blurred"					# https://github.com/dwarvesf/blurred
#cask "micro-sniff"				# https://github.com/dwarvesf/micro-sniff
#cask "macfuse"			                # https://osxfuse.github.io/
cask "alfred"			                # https://www.alfredapp.com/	
#cask "meetingbar"		                # https://meetingbar.onrender.com
#cask "hazel"			                # https://www.noodlesoft.com/
#cask "cheatsheet"		              	# https://www.mediaatelier.com/CheatSheet/
#cask "ngrok"					# https://dashboard.ngrok.com/get-started/setup	
#cask "wkhtmltopdf"				# https://wkhtmltopdf.org/
#cask "basecamp"				# https://basecamp.com/
cask "commander-one"				# https://mac.eltima.com/file-manager.html
#cask "keyboard-maestro"			# https://www.keyboardmaestro.com/main/
cask "protonvpn"				# https://proton.me
cask "slack"					# https://slack.com
cask "bartender"				# https://www.macbartender.com/
cask "proton-mail"				# https://proton.me
cask "proton-drive"				# https://proton.me	
cask "macwhisper"				# https://goodsnooze.gumroad.com/l/macwhisper

# ~~~~~~~~~ Messenger ~~~~~~~~~ 

cask "whatsapp"
cask "zoom"
#cask "bitmessage"		              	# https://bitmessage.org/wiki/Main_Page
#cask "teamviewer"
cask "signal"
#cask "telegram"
#cask "mattermost"
#cask "sync"                        		# https://www.sync.com/
#cask "discord"			                # https://discord.com/

# ~~~~~~~~~ Browser ~~~~~~~~~

cask "tor-browser"				# https://www.torproject.org/download/
cask 'firefox'					# https://www.mozilla.org/de/firefox/new/
cask 'google-chrome'				# https://www.google.com/chrome
#cask "brave-browser"		            	# https://brave.com
#cask "arc"

#~~~~~~~~~ Dokumentation & Writing ~~~~~~~~~

#cask "appflowy"			        # https://github.com/AppFlowy-IO/appflowy
cask "devonthink"		                # https://www.devontechnologies.com/apps/devonthink/
#cask "bibdesk"			                # https://bibdesk.sourceforge.io/
#cask "macdown"			                # https://macdown.uranusjr.com/	
#cask "zettlr"			                # https://www.zettlr.com/download/macos
brew "pandoc"					# https://pandoc.org
cask "basictex"			                # https://www.tug.org/mactex/morepackages.html"
cask "obsidian"				        # https://obsidian.md/
cask "moneymoney"		              	# https://moneymoney-app.com/
cask "miro"			                # https://miro.com/
#cask "the-archive"				# https://zettelkasten.de/the-archive/		
cask "notion"					# https://notion.so
#cask "languagetool"				# https://languagetool.org
cask "scrivener"				# https://www.literatureandlatte.com	
#cask "skim"					# https://sourceforge.net/projects/skim-app/
#cask "bookends"				# https://www.sonnysoftware.com/bookends-for-mac/downloads
cask "cahier"					# https://getcahier.com/
brew "inlyne"					# https://github.com/Inlyne-Project/inlyne

# ~~~~~~~~~ Design & Drawing ~~~~~~~~~

#cask "krita"				        # https://krita.org/
#cask "firealpaca"			        # https://firealpaca.com/
#cask "medibangpaintpro"		        # https://medibangpaint.com/		
#cask "font-hack-nerd-font"	
cask "inkscape"
#brew "imageoptim-cli"				# https://github.com/JamieMason/ImageOptim-CLI
cask "imageoptim"				# https://imageoptim.com/mac
#cask "gimp"					# https://www.gimp.org/
#cask "affinity-photo"				# https://affinity.serif.com/en-us/photo/
#cask "drawio"					# https://www.drawio.com/

# ~~~~~~~~~ Data Management ~~~~~~~~~

cask "google-drive"			        # https://www.google.com/drive/
cask "mountain-duck"			        # https://mountainduck.io/
cask "cyberduck"			        # https://cyberduck.io/
cask "transmit"
#brew "ipfs"
#brew "fzf" 				        # https://github.com/junegunn/fzf
#cask "syncthing"		                # https://syncthing.net/
#cask "nextcloud"
#cask "arq"			                # https://www.arqbackup.com/
cask "path-finder"
#cask "google-earth-pro"			# https://www.google.com/earth/versions/#earth-pro
#cask "xnviewmp"				# https://www.xnview.com/en/xnviewmp/

# ~~~~~~~~~ Video ~~~~~~~~~

cask "deluge"			                # https://deluge-torrent.org/
cask "vlc"			                # https://www.videolan.org/vlc/
#cask "handbrake"		                # https://handbrake.fr/
#cask "wondershare-filmora"	        	# https://filmora.wondershare.com/

# ~~~~~~~~~ Audio ~~~~~~~~~

cask "spotify"
#cask "freac"			                # https://www.freac.org/
cask "audacity"					# https://www.audacityteam.org/

# ~~~~~~~~~ Blockchain & Crypto ~~~~~~~~~

#brew "cointop"				        # https://github.com/miguelmota/cointop
#cask "ledger-live"		

# ~~~~~~~~~ Sport ~~~~~~~~~

#cask "zwift"

# ~~~~~~~~~ Software Development Editors ~~~~~~~~~

cask "visual-studio-code"	          	# https://code.visualstudio.com/

# ~~~~~~~~~ Programming languages ~~~~~~~~~

brew "rbenv"
brew "ruby-build"
brew "rust"
brew "rustup"
#brew "pyenv"				        # https://wilsonmar.github.io/pyenv/
#brew "pyenv-virtualenv"			
#cask "anaconda"
#brew 'jupyterlab'
#brew 'jython'			                # https://www.jython.org
#brew "go"
#brew "upx"			                # https://upx.github.io/
#brew 'hugo'			                # https://gohugo.io/	
#brew "java"
#cask 'adoptopenjdk8'		            	# https://maelfabien.github.io/bigdata/SparkInstall/#
cask "temurin"					# https://adoptium.net/
brew "node"
brew "node-sass"
brew "npm"
#brew "crystal"
#brew 'scala'
#brew 'php'
brew 'shivammathur/php/php@8.3'
brew 'maven'
brew 'nvm'

# ~~~~~~ Container ~~~~~~ 

cask 'docker'			                # https://www.docker.com/products/docker-desktop
#cask 'orbstack'				# https://orbstack.dev/
cask 'podman-desktop'				# https://podman.io

# ~~~~~~~~~ K8s ~~~~~~~~~

#cask 'lens'			                # https://k8slens.dev/
#brew 'k3d'			                # https://k3d.io/
#brew "helm"			                # https://helm.sh

# ~~~~~~~~~ Software Development Helper ~~~~~~~~~

#cask "github"
#cask 'phantomjs'		                # https://phantomjs.org/
cask "postman"			                # https://www.postman.com/
#brew "gh"				        # https://cli.github.com/
#brew "mermaid-cli"			        # https://www.npmjs.com/package/@mermaid-js/mermaid-cli/v/8.9.2
brew "hivemind"                     		# https://github.com/DarthSim/hivemind
#brew "overmind"                    		# https://github.com/DarthSim/overmind
#brew "twilio-cli"				# https://www.twilio.com/docs/sms/quickstart/ruby
#cask "graphql-playground"			# https://github.com/graphql/graphql-playground
brew "glab"					# GitLab CLI
cask "devtoys"					# https://devtoys.app/download
brew "logstash"					# https://www.elastic.co/downloads/logstash

# ~~~~~~~~~ Database ~~~~~~~~~

## MySQL

brew "mysql"
brew "mysql-client"

## Redis

brew "redis"
cask "redisinsight"

## Memcached

#brew "memcached"

## Elastic

#brew "elastic/tap/elasticsearch-full"  	# https://www.elastic.co/guide/en/elasticsearch/reference/7.13/brew.html
#brew "elastic/tap/kibana-full"			# https://www.elastic.co/guide/en/kibana/current/brew.html
#brew "elastic/tap/metricbeat-full"

## CouchDB  

brew "coreutils"
#brew "erlang"
brew "autoconf-archive"
brew "automake"
brew "icu4c"
brew "gpg"
#brew "spidermonkey"

## ArangoDB
#brew 'arangodb'					# https://arangodb.com

## PostgreSQL
brew 'postgresql@14'				

# ~~~~~~~~~ DB Tools ~~~~~~~~~

#cask "sequel-pro"			        # https://sequelpro.com/
#cask "sqlpro-studio"			        # https://www.sqlprostudio.com/	
cask "dbeaver-community"	          	# https://dbeaver.io/	
cask "tableplus"				# https://tableplus.com/
#cask "postbird"				# https://github.com/Paxa/postbird

# ~~~~~~~~~ Data Science ML AI ~~~~~~~~~

#brew 'apache-spark'		            	# https://spark.apache.org/
#brew 'hadoop'			                # for pyspqrk
#brew 'jupyterlab'
#brew 'jython'                   		# https://www.jython.org
#brew "tensorflow"				# https://www.tensorflow.org 
#cask "anaconda"				# https://anaconda.org
#cask "miniconda"				# https://repo.anaconda.com/miniconda
brew "tesseract"				# https://tesseract-ocr.github.io/
brew "tesseract-lang"
brew "gptscript"				# https://github.com/gptscript-ai/gptscript	

# ~~~~~~~~~ AWS ~~~~~~~~~

brew "awscli" 				        # https://aws.amazon.com/cli/              

# ~~~~~~~~~ GCP ~~~~~~~~~
#
#

# ~~~~~~~~BPMN ~~~~~~~~~

#cask "camunda-modeler" 

# ~~~~~~~~~ Security ~~~~~~~~~

#cask "owasp-zap"		                # https://www.zaproxy.org/
#cask "lulu"                    		# https://objective-see.com/products/lulu.html
#cask "blockblock"              		# https://objective-see.com/products/blockblock.html
#cask "netiquette"              		# https://objective-see.com/products/netiquette.html
#cask "wireshark"               		# https://www.wireshark.org/ | https://gitlab.com/wireshark/wireshark/wikis/
brew "trivy"					# https://github.com/aquasecurity/trivy | https://trivy.dev/

# ~~~~~~~~~ Maintenance Software ~~~~~~~~~

#cask "carbon-copy-cloner"
#cask "onyx"      		                # https://www.titanium-software.fr/en/onyx.html
cask "appzapper" 		                # https://www.appzapper.com/
#cask "wifi-explorer"		            	# https://www.intuitibits.com/products/wifi-explorer/				
#cask "itsycal"                     		# https://www.mowglii.com/itsycal/
