# Brewfile by Andy Wenk
#
# This is the software I use on a fresh machine.

# tap

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "heroku/brew"
tap "twilio/brew"
#tap "elastic/tap"			        # https://www.elastic.co/guide/en/elasticsearch/reference/7.13/brew.html
cask_args appdir: "/Applications"

# ~~~~~~~~~ Unix tools ~~~~~~~~~ 

brew "gzip"
brew "p7zip"				        # https://github.com/jinfeihan57/p7zip
brew "pwgen"
brew "nmap"
brew "wget"
brew "htop"
brew "imagemagick"
cask "iterm2"
cask "the-unarchiver"
brew "pandoc"
brew "vim"
brew "tree"
#brew "rclone"
#brew "rsync"
#brew "tldr"
#brew "ncdu"
brew "ffmpeg"
#brew "broot"
#brew "shellcheck"
brew "mmv"				        # https://github.com/rrthomas/mmv
brew "mkcert"                       		# https://github.com/FiloSottile/mkcert
brew "rmlint"			                # https://github.com/sahib/rmlint
brew "irssi"			                # https://irssi.orgq
brew "asciinema"				# https://asciinema.org/
brew "tmux"
brew "pre-commit"				# https://pre-commit.com/
#cask "appflowy"			# https://github.com/AppFlowy-IO/appflowy
brew "gh"				# https://cli.github.com/
cask "google-drive"			# https://www.google.com/drive/
cask "mountain-duck"			# https://mountainduck.io/
brew "b2-tools"				# https://www.backblaze.com/b2/docs/quick_command_line.html		

# ~~~~~~~~~ Network ~~~~~~~~~

#cask "wireshark"		                # https://www.wireshark.org/ | https://gitlab.com/wireshark/wireshark/wikis/

# ~~~~~~~~~ Tools ~~~~~~~~~ 

cask "caffeine"
#cask "1password-beta"		          	# https://1password.com/
cask "1password-cli"
#cask "gpg-suite"
#cask "cakebrew"
cask "kindle"
#cask "gemini"			                # https://macpaw.com/gemini
#cask "deepl"			                # https://www.deepl.com/translator	
#cask "rcloneosx"
#cask "rsyncosx"
#brew "cabextract"
cask "evernote"
cask "bettertouchtool"		          	# https://folivora.ai/
cask "skitch"
cask "licecap"			                # https://www.cockos.com/licecap/
cask "hiddenbar"		                # https://github.com/dwarvesf/hidden
cask "macfuse"			                # https://osxfuse.github.io/
cask "alfred"			                # https://www.alfredapp.com/	
cask "meetingbar"		                # https://meetingbar.onrender.com
#cask "hazel"			                # https://www.noodlesoft.com/
#cask "cheatsheet"		              	# https://www.mediaatelier.com/CheatSheet/
cask "ngrok"					# https://dashboard.ngrok.com/get-started/setup	
#cask "wkhtmltopdf"				# https://wkhtmltopdf.org/

# ~~~~~~~~~ Messenger ~~~~~~~~~ 

cask "whatsapp"
cask "zoom"
#cask "bitmessage"		              	# https://bitmessage.org/wiki/Main_Page
#cask "teamviewer"
cask "signal"
#cask "telegram"
#cask "mattermost"
#cask "sync"                        		# https://www.sync.com/
cask "discord"			                # https://discord.com/

# ~~~~~~~~~ Browser ~~~~~~~~~

#cask "tor-browser"
cask 'firefox'
cask 'google-chrome'
cask "brave-browser"		            	# https://brave.com

#~~~~~~~~~ Dokumentation & Writing ~~~~~~~~~

#cask "appflowy"			        # https://github.com/AppFlowy-IO/appflowy
cask "devonthink"		                # https://www.devontechnologies.com/apps/devonthink/
#cask "bibdesk"			                # https://bibdesk.sourceforge.io/
cask "macdown"			                # https://macdown.uranusjr.com/	
cask "zettlr"			                # https://www.zettlr.com/download/macos
#cask "basictex"		                # https://www.tug.org/mactex/morepackages.html"
cask "obsidian"				        # https://obsidian.md/
#cask "moneymoney"		              	# https://moneymoney-app.com/
#cask "miro"			                # https://miro.com/
cask "the-archive"				# https://zettelkasten.de/the-archive/		

# ~~~~~~~~~ Design & Drawing ~~~~~~~~~

#cask "krita"				        # https://krita.org/
#cask "firealpaca"			        # https://firealpaca.com/
#cask "medibangpaintpro"		        # https://medibangpaint.com/		
#cask "font-hack-nerd-font"	
cask "inkscape"
#brew "imageoptim-cli"				# https://github.com/JamieMason/ImageOptim-CLI
cask "imageoptim"				# https://imageoptim.com/mac

# ~~~~~~~~~ Data Management ~~~~~~~~~

cask "google-drive"			        # https://www.google.com/drive/
cask "mountain-duck"			        # https://mountainduck.io/
cask "cyberduck"			        # https://cyberduck.io/
#cask "transmit"
#brew "ipfs"
#brew "fzf" 				        # https://github.com/junegunn/fzf
#cask "syncthing"		                # https://syncthing.net/
#cask "nextcloud"
#cask "arq"			                # https://www.arqbackup.com/
cask "path-finder"

# ~~~~~~~~~ Video ~~~~~~~~~

cask "deluge"			                # https://deluge-torrent.org/
cask "vlc"			                # https://www.videolan.org/vlc/
cask "handbrake"		                # https://handbrake.fr/
#cask "wondershare-filmora"	        	# https://filmora.wondershare.com/

# ~~~~~~~~~ Audio ~~~~~~~~~

cask "spotify"
cask "freac"			                # https://www.freac.org/

# ~~~~~~~~~ Blockchain & Crypto ~~~~~~~~~

#brew "cointop"				        # https://github.com/miguelmota/cointop
#cask "ledger-live"		

# ~~~~~~~~~ Sport ~~~~~~~~~

#cask "zwift"

# ~~~~~~~~~ Software Development Editors ~~~~~~~~~

cask "visual-studio-code"	          	# https://code.visualstudio.com/

# ~~~~~~~~~ Programming languages ~~~~~~~~~

brew "rbenv"
brew "ruby-build"
brew "rust"
brew "pyenv"				        # https://wilsonmar.github.io/pyenv/
#brew "pyenv-virtualenv"			
#cask "anaconda"
brew 'jupyterlab'
#brew 'jython'			                # https://www.jython.org
brew "go"
#brew "upx"			                # https://upx.github.io/
#brew 'hugo'			                # https://gohugo.io/	
#brew "java"
cask 'adoptopenjdk8'		            	# https://maelfabien.github.io/bigdata/SparkInstall/#
brew "npm"
#brew "crystal"
#brew 'scala'
#brew 'php'

# ~~~~~~~~~ K8s ~~~~~~~~~

#cask 'lens'			                # https://k8slens.dev/
#brew 'k3d'			                # https://k3d.io/
#cask 'docker'			                # https://www.docker.com/products/docker-desktop
#brew "helm"			                # https://helm.sh

# ~~~~~~~~~ Software Development Helper ~~~~~~~~~

#cask "github"
#cask 'phantomjs'		                # https://phantomjs.org/
cask "postman"			                # https://www.postman.com/
brew "gh"				        # https://cli.github.com/
#brew "mermaid-cli"			        # https://www.npmjs.com/package/@mermaid-js/mermaid-cli/v/8.9.2
brew "hivemind"                     		# https://github.com/DarthSim/hivemind
brew "overmind"                    		# https://github.com/DarthSim/overmind
#brew "twilio-cli"				# https://www.twilio.com/docs/sms/quickstart/ruby

# ~~~~~~~~~ Database ~~~~~~~~~

## MySQL

brew "mysql"
brew "mysql-client"

## Redis

brew "redis"
cask "redisinsight"

## Memcached

#brew "memcached"

## Elastic

#brew "elastic/tap/elasticsearch-full"  	# https://www.elastic.co/guide/en/elasticsearch/reference/7.13/brew.html
#brew "elastic/tap/kibana-full"			# https://www.elastic.co/guide/en/kibana/current/brew.html
#brew "elastic/tap/metricbeat-full"

## CouchDB  

brew "coreutils"
brew "erlang"
brew "autoconf-archive"
brew "automake"
brew "icu4c"
brew "gpg"
brew "spidermonkey"

## ArangoDB
brew 'arangodb'					# https://arangodb.com

## PostgreSQL
brew 'postgresql@15'				

# ~~~~~~~~~ DB Tools ~~~~~~~~~

<<<<<<< HEAD
cask "sequel-pro"			        # https://sequelpro.com/
cask "sqlpro-studio"			        # https://www.sqlprostudio.com/	
#cask "dbeaver-community"	          	# https://dbeaver.io/	
cask "tableplus"
cask "postbird"					# https://github.com/Paxa/postbird

# ~~~~~~~~~ Data Science ~~~~~~~~~

#brew 'apache-spark'		            	# https://spark.apache.org/
#brew 'hadoop'			                # for pyspqrk

# ~~~~~~~~~ AWS ~~~~~~~~~

brew "awscli" 				        # https://aws.amazon.com/cli/              

# ~~~~~~~~~ Security ~~~~~~~~~

#cask "owasp-zap"		                # https://www.zaproxy.org/
||||||| parent of 7888171 (comment out various software)
# software
#cask "font-hack-nerd-font"                     
#cask "gpg-suite"
cask "iterm2"                                  
#cask "tor-browser"
#cask "zenmate-vpn"
cask "the-unarchiver"
cask "whatsapp"
cask "zoom"
#cask "sync"
cask "skitch"
cask "transmit"
cask "cakebrew"
#cask "owasp-zap"
cask "postman"			# https://www.postman.com/
#cask "teamviewer"
cask "visual-studio-code"	# https://code.visualstudio.com/
#cask "carbon-copy-cloner"
cask "deluge"			# https://deluge-torrent.org/
cask "vlc"			# https://www.videolan.org/vlc/
cask "handbrake"		# https://handbrake.fr/
cask "onyx"      		# https://www.titanium-software.fr/en/onyx.html
cask "kindle"
#cask "bitmessage"		# https://bitmessage.org/wiki/Main_Page
#cask "gemini"			# https://macpaw.com/gemini
#cask "deepl"			# https://www.deepl.com/translator	
#cask "github"			
cask "signal"
#cask "java"
#cask "telegram"
#cask "itsycal"
#cask "rcloneosx"
#cask "rsyncosx"
=======
# software
#cask "font-hack-nerd-font"                     
#cask "gpg-suite"
cask "iterm2"                                  
#cask "tor-browser"
#cask "zenmate-vpn"
cask "the-unarchiver"
#cask "whatsapp"
#cask "zoom"
#cask "sync"
#cask "skitch"
#cask "transmit"
#cask "cakebrew"
#cask "owasp-zap"
#cask "postman"			# https://www.postman.com/
#cask "teamviewer"
cask "visual-studio-code"	# https://code.visualstudio.com/
#cask "carbon-copy-cloner"
#cask "deluge"			# https://deluge-torrent.org/
#cask "vlc"			# https://www.videolan.org/vlc/
cask "handbrake"		# https://handbrake.fr/
#cask "onyx"      		# https://www.titanium-software.fr/en/onyx.html
#cask "kindle"
#cask "bitmessage"		# https://bitmessage.org/wiki/Main_Page
#cask "gemini"			# https://macpaw.com/gemini
#cask "deepl"			# https://www.deepl.com/translator	
#cask "github"			
#cask "signal"
#cask "java"
#cask "telegram"
#cask "itsycal"
#cask "rcloneosx"
#cask "rsyncosx"
>>>>>>> 7888171 (comment out various software)
#cask "micro-snitch"
<<<<<<< HEAD
cask "cryptomator"		              	# https://cryptomator.org/
cask "viscosity"
#cask "vyprvpn"
#cask "lulu"			                # https://objective-see.com/products/lulu.html
#cask "blockblock"		              	# https://objective-see.com/products/blockblock.html
#cask "netiquette"		              	# https://objective-see.com/products/netiquette.html
#cask "veracrypt"		                # https://veracrypt.fr/en/
||||||| parent of 7888171 (comment out various software)
#cask "mattermost"
cask "inkscape"
cask "evernote"
cask "freac"			# https://www.freac.org/
#cask "dbeaver-community"	# https://dbeaver.io/	
cask "appzapper" 		# https://www.appzapper.com/
#cask "wifi-explorer"		# https://www.intuitibits.com/products/wifi-explorer/				
#cask "1password-beta"		# https://1password.com/
cask "bettertouchtool"		# https://folivora.ai/
cask "brave-browser"		# https://brave.com
cask "cryptomator"		# https://cryptomator.org/
cask "devonthink"		# https://www.devontechnologies.com/apps/devonthink/	
#cask "firefox"			# https://firefox.com
#cask "wondershare-filmora"	# https://filmora.wondershare.com/
cask "spotify"			#
cask "licecap"			# https://www.cockos.com/licecap/
#cask "ledger-live"		#
#cask "nextcloud"		#
#cask "tableplus"		#
#cask "moneymoney"		# https://moneymoney-app.com/
cask "arq"			# https://www.arqbackup.com/
#cask "path-finder"		#
cask "vyprvpn"			#
#cask "syncthing"		# https://syncthing.net/
#cask "miro"			# https://miro.com/
cask "viscosity"		# 
#cask "zwift"			#
cask "hiddenbar"		# https://github.com/dwarvesf/hidden
cask "macfuse"			# https://osxfuse.github.io/
cask "alfred"			# https://www.alfredapp.com/	
#cask "hazel"			# https://www.noodlesoft.com/
#cask "cheatsheet"		# https://www.mediaatelier.com/CheatSheet/
cask "obsidian"			# https://obsidian.md/
cask "meetingbar"		# https://meetingbar.onrender.com
cask "discord"			# https://discord.com/
=======
#cask "mattermost"
#cask "inkscape"
#cask "evernote"
#cask "freac"			# https://www.freac.org/
#cask "dbeaver-community"	# https://dbeaver.io/	
cask "appzapper" 		# https://www.appzapper.com/
#cask "wifi-explorer"		# https://www.intuitibits.com/products/wifi-explorer/				
cask "1password"		# https://1password.com/
#cask "bettertouchtool"		# https://folivora.ai/
cask "brave-browser"		# https://brave.com
cask "cryptomator"		# https://cryptomator.org/
cask "devonthink"		# https://www.devontechnologies.com/apps/devonthink/	
#cask "firefox"			# https://firefox.com
#cask "wondershare-filmora"	# https://filmora.wondershare.com/
#cask "spotify"			#
#cask "licecap"			# https://www.cockos.com/licecap/
#cask "ledger-live"		#
#cask "nextcloud"		#
#cask "tableplus"		#
#cask "moneymoney"		# https://moneymoney-app.com/
#cask "arq"			# https://www.arqbackup.com/
#cask "path-finder"		#
#cask "vyprvpn"			#
#cask "syncthing"		# https://syncthing.net/
#cask "miro"			# https://miro.com/
#cask "viscosity"		# 
#cask "zwift"			#
#cask "hiddenbar"		# https://github.com/dwarvesf/hidden
cask "macfuse"			# https://osxfuse.github.io/
cask "alfred"			# https://www.alfredapp.com/	
#cask "hazel"			# https://www.noodlesoft.com/
#cask "cheatsheet"		# https://www.mediaatelier.com/CheatSheet/
#cask "obsidian"			# https://obsidian.md/
#cask "meetingbar"		# https://meetingbar.onrender.com
#cask "discord"			# https://discord.com/
>>>>>>> 7888171 (comment out various software)

<<<<<<< HEAD
# ~~~~~~~~~ Maintenance Software ~~~~~~~~~
||||||| parent of 7888171 (comment out various software)
# security	
#cask "lulu"			# https://objective-see.com/products/lulu.html
#cask "blockblock"		# https://objective-see.com/products/blockblock.html
#cask "netiquette"		# https://objective-see.com/products/netiquette.html
#cask "wireshark"		# https://www.wireshark.org/ | https://gitlab.com/wireshark/wireshark/wikis/

# writing
#cask "bibdesk"			# https://bibdesk.sourceforge.io/
cask "macdown"			# https://macdown.uranusjr.com/	
cask "zettlr"			# https://www.zettlr.com/download/macos
#cask "basictex"		# https://www.tug.org/mactex/morepackages.html"

# K8s
#cask 'lens'			# https://k8slens.dev/
#brew 'k3d'			# https://k3d.io/
#cask 'docker'			# https://www.docker.com/products/docker-desktop
#brew "helm"			# https://helm.sh

# Data Science
brew 'apache-spark'		# https://spark.apache.org/
cask 'adoptopenjdk8'		# https://maelfabien.github.io/bigdata/SparkInstall/#
brew 'scala'	
brew 'jupyterlab'
brew 'php'
cask 'phantomjs'		# https://phantomjs.org/
brew 'jython'			# https://www.jython.org
brew 'hadoop'			# for pyspqrk

# browser
cask 'firefox'
cask 'google-chrome'
=======
# security	
#cask "lulu"			# https://objective-see.com/products/lulu.html
#cask "blockblock"		# https://objective-see.com/products/blockblock.html
#cask "netiquette"		# https://objective-see.com/products/netiquette.html
#cask "wireshark"		# https://www.wireshark.org/ | https://gitlab.com/wireshark/wireshark/wikis/

# writing
#cask "bibdesk"			# https://bibdesk.sourceforge.io/
#cask "macdown"			# https://macdown.uranusjr.com/	
#cask "zettlr"			# https://www.zettlr.com/download/macos
#cask "basictex"		# https://www.tug.org/mactex/morepackages.html"

# K8s
#cask 'lens'			# https://k8slens.dev/
#brew 'k3d'			# https://k3d.io/
#cask 'docker'			# https://www.docker.com/products/docker-desktop
#brew "helm"			# https://helm.sh

# Data Science
brew 'apache-spark'		# https://spark.apache.org/
cask 'adoptopenjdk8'		# https://maelfabien.github.io/bigdata/SparkInstall/#
brew 'scala'	
brew 'jupyterlab'
brew 'php'
cask 'phantomjs'		# https://phantomjs.org/
brew 'jython'			# https://www.jython.org
brew 'hadoop'			# for pyspqrk

# browser
cask 'firefox'
cask 'google-chrome'
>>>>>>> 7888171 (comment out various software)

#cask "carbon-copy-cloner"
#cask "onyx"      		                # https://www.titanium-software.fr/en/onyx.html
cask "appzapper" 		                # https://www.appzapper.com/
#cask "wifi-explorer"		            	# https://www.intuitibits.com/products/wifi-explorer/				
#cask "itsycal"                     		# https://www.mowglii.com/itsycal/
